# ფუნქცია არის კოდების ერთობლიობა რომელიც ასრულებს რაღაც მოქმედებას
# არგუმენტი არის ის მნიშვნელობა რომელიც გადაეცემა ფუნქციას,  გამოძახების დროს


# Built in Functions:
# print() - ტერმინალში გამოაქვს რასაც გადასცემს
# len() - იმ ელემენტის სიგრძე გამოაქვს რასაც გადასცემ
# type() - იმ ელემენტის მონაცემთა ტიპი გამოაქვს რასაც გადასცემ
# int() - რასაც გადასცემ ინტეჯერად გადააქცევს
# str() - რასაც გადასცემ სტრინგად გადააქცევს
# float() - რასაც გადასცემ ათწილადად გადააქცევს
# bool() - რასაც გადასცემ დადებითად ან უარყოფად გადააქცევს
# max() - ყველაზე მაღალი რიცხვი გამოაქვს
# min() - ყველაზე ნაკლები რიცხვი გამოაქვს
# sum() - ყველა რიცხვს გამოითვლის
# input() - მომხმარებელს ტერმინალში ეკითხება ინფორმაციას



def my_name():
    print("lazare mamuchashvili")



def calculator(num1, num2):
    print(num1 + num2)
    print(num1 - num2)
    print(num1 * num2)
calculator(7, 13)