name = "Lazare"
age = 14
andress = "tbilisi"
print(name, age, andress)


# string(str) = ტექსტური მონაცემთა ტიპი მაგალითად "Lazare"    
# integer(int) = რიცხვითი მონაცემთა ტიპი მაგალითად age = 14
# boolean(bool) = ლოგიკური მონაცემთა ტიპი მაგალითად True or False
# float = ყველა ათწილადი რიცხვი მაგალითად 1.2
print("Luka")
print(21)
print(True)
print(1.2)


# დეკლარაცია = ნიშნავს ცვლადების სახელის შექმნას მაგალითად name
# ინიციალიზება = ნიშნავს ცვლადზე მნიშვნელობის მინიჭებას მაგალითად name = "lazare"
# რეინიციალიზება = ნიშნავს ცვლადის მნიშვნელობის განახლებას ან მნიშვნელობის შეცვლას მაგალითად name = "Luka"