# quiz

score = 0


answer1 = input("1. საქართველოს დედაქალაქი რომელია? ")
if answer1 == "თბილისი":
    print("სწორია")
    score = score + 1
else:
    print("არასწორია სწორი პასუხია: თბილისი")

answer2 = input("2. რამდენი მხარე აქვს სამკუთხედს? ")
if answer2 == "3":
    print("სწორია")
    score = score + 1
else:
    print("არასწორია სწორი პასუხია: 3")

answer3 = input("3. Python პროგრამირების ენა რაში გამოიყენება? 1. თამაშები 2. მონაცემთა ანალიზი 3. ხელოვნური ინტელექტი 4. ზემოთ ყველა: ")
if answer3 == "4":
    print("სწორია")
    score = score + 1
else:
    print("არასწორია სწორი პასუხია: 4")

print("შენი ქულა არის", score)


answer4 = input("4. რამდენი კუთხე აქვს ოთხუთხედს: 1. 2 გვერდი  2. 3 გვერდი 3. 4 გვერდი. 4. 5 გვერდი ")
if answer4 == "3":
    print("სწორია")
    score = score + 1
else:
    print("არასწორია სწორი პასუხია: 3")

print("შენი ქულა არის", score)


answer5 = input("4. რამდენი კუთხე აქვს წრეს: 1. 0 გვერდი  2. 1 გვერდი 3. 2 გვერდი. 4. 3 გვერდი ")
if answer5 == "1":
    print("სწორია")
    score = score + 1
else:
    print("არასწორია სწორი პასუხია: 1")

print("შენი ქულა არის", score)
